module attributes {llvm.data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", llvm.target_triple = "x86_64-unknown-linux-gnu", "onnx-mlir.symbol-postfix" = "model"} {
  func.func @main_graph(%arg0: tensor<?x25xf32> {onnx.dim_params = "0:batch_size", onnx.name = "input"}) -> (tensor<?x10xf32> {onnx.dim_params = "0:batch_size", onnx.name = "output"}) {
    %0 = onnx.Constant dense<"0xA548DBBEBB992EBF8408603D894ACE3D38B347BD780BBBBE0649B8BE1642C73C5FC6313FF5858B3E3647C1BEB8F601BEE12FCC3EB8E2533E50EE23BEE6C0973DA3E520BFDCB49DBEDAD8C0BE8B47BBBDB46715BE36A337BF841118BED585173FABDE4B3E76CFF6BE4A17A9BE9A81193DB20F203F638F193F8A8276BE0F28A1BDD461463C80A4613E3D94DDBE1EBB793E088DFDBEE87D963D8D6435BE48607EBE722D20BE12819A3D7D29C83DD4F46F3CEE94B8BC8BEAF23DD87347BEA952623E575C463E899F403FEAB74F3D968F203E71821BBFE4C99E3E748CC63E6560233F1E75AE3E79FE8DBD0551C0BE029A16BEE9EC0EBE3777D4BC8706193E9A3C38BE0D9B033F6D76E23E4FBE213DE6D60F3D909680BE129BAB3EDD38183FCCA9D23E4FDFA43EC8D2143F198127BEAE26303F506142BE22C6C03DB3F2BD3D69D52A3E9C49313F7B22B33EC572DA3E655C963EAD050ABE73348CBDA036373E395B9B3E527290BEC275433F120F6B3EA0AB0F3E83C3BDBE47583E3F3FDD49BF67A7F63DCD6440BED7DDBBBEDB49C83CD23030BD408A30BF2940D7BE4637913EC0DE563CF26CFCBCF3BA29BDCE1258BEAA0FB43B6E718FBFE36F21BD2FA8BFBEDCCD44BC26DF8E3E7148C5BEE3AC0CBE0C51DE3ECEB2BD3ED942AC3C6BB9A7BE5891473F0D831BBFBB9941BDBAABCD3E9B742E3FB635023FDDB632BE902796BE8728683DFA9C32BF2679F23E244EC8BE0D8A2A3E39713A3ED68D56BEA6387ABE510A653E4912B23D6AD71C3C5EA68FBE1550763F74FCDDBEB6C5403F6EAEDA3E37351BBE95F41DBCA2FF453EEDA27E3E8198763E7D543E3E822943BE0218BCBEA6227CBBA22F0D3CBB6CD0BEC8B4FD3D008A143EDCE8D1BE72F45A3EA60DC4BE33C4583EA54446BF4A4B74BE8DDF153FA3C696BDAB70A6BD90E287BE9592B13DE662043D9A3205BD93613CBFBDDF57BE0C3B903E1B6D923EC099D23E7346163E65B9163F16DF3DBE0556BFBE1221C13D534173BEA0015D3F526051BE41F9593E74B6DF3EAD73163DAD790FBE9745FD3E09F185BE4170FFBE468E0DBF3E41483FB4C1B13D376F18BF2BCEA6BCAA8C79BEB19A973E5DFE433E7C9E043B3903B7BE4E723BBEFE83BA3E7E0600BF45E24EBE2AEC593FECEDF63EC624FF3CB29967BDB30392BE3A3AD83E10EEE43DEC5CEB3EF799683ED8F08E3E47B1B1BEC091DE3EDB1F0DBE41D4E13EB0F930BEFE6683BD581CADBE7E4D0B3F77FD9F3E3C5887BE73D1063F81EEA93EE411193E5E1BE03DBB8A07BED1D9073F04721CBCD04FB93EC999A3BD1158A33EF40D01BF414596BC3C0A76BEC12EF83EB425D73E1242723DBC1B2EBFA201903D1320293F581675BF2B7F993E610483BEF7CF25BE266B173E73AEEE3EDF4B1F3E2EF39CBDD21D1EBF7ACC83BE6F77CC3E4CC701BD61A59BBE363FBE3E640396BEBE4CF53EA722033F836A54BE6274453DC510253D1FA7B2BD2317703DC5A80A3F521BBFBE93E110BFBFDE0B3F8ADFAABE4610E0BE4F6008BFDD44BB3DAF8C053F7F699F3E6609E43EAE861F3EDF68B6BE8A0D80BCFB7DAEBDA9E2073E2EAD4E3E14E987BEC90ED3BDE3CFA33D656EA63EFB95343E5DDEFEBEB177843E407434BEC86F8CBE3AD2C53DB470DEBC41510F3FF2B8BBBDF880213F27320A3E489D95BEC9A5B7BC77B689BE7E7D43BEE79D0D3E77E622BE4CE0663E50A9C9BC32AF82BDD13C313F2EB6323EAEE405BD1DFF323EB72CD7BEA8BC053F5A1F663FBE1D2E3D371FA13DE763083FE40AC2BE430F053FEFD17F3F6AD3B53EE5A7F3BEDEF378BE8F01CCBD9EC3193E74ECF23EB22D4CBF0824373F36E2A3BE63221CBFEFADC6BEBD7953BECC9191BE6B9D2B3F1D7177BE33094F3E8A4F183E360B603CEAAE503FEEE8F03E22DFE43E1A1A9D3EC4FF08BB527F013F57D0F2BCF02BB43DEEB22FBE4ACEF6BD43047FBB670916BF6C474E3CCDE0BDBE64C443BF7539303EA7DD51BED30F1D3FA0B4CFBD21BDAEBE5F77333FE71BCDBE68E6CA3ECC06233F9BB5FC3C596EDEBDA263D83E7015543DF68F6D3E394F1D3EFFADBB3E8CE1DF3EF8751EBC3AC2D5BEEB72FA3E0C16823D3143D33CA920A63EBCEC133FDF785DBEFDACEA3E86931CBDAEC7C73D07C753BCEAB6BDBC5EDE00BF6FA7E43E51E7A4BD7634933E5A58473FE0E420BF6349103F610A8D3E62BAD3BCE7C0D8BD9A6B40BE329889BE35E0BA3E0E41283FC52B19BE10EFD3BE3DCA9D3E023BC03E4290BFBED4609BBED611AD3DC4DD55BE5B6C3FBF3918C23E02CF4B3EBC36D03E9092B5BC04150BBEC1D0843E04B0793EDB6A7EBF54C506BF808D873E30770BBF43BD5F3E40BE63BECC01023F7CAD49BEAF5FD2BD5EC01EBD371050BD69A79EBE8334353EE3AADE3E95B69D3EF4008F3E5675D1BEFCD7443EA2AB953E3BB7553E847674BFFC682BBF95E63B3E51FAB2BDE879CDBB3B1FD0BEA93EB3BEA788BBBDD95CCA3D4D8D433E3AF7CC3DE8BE2FBA0397083EF4341FBD728D013FE8E0093FEE2442BE2517E53DCE3A313EF160F4BDF56558BE4415CABE8B951F3FB8A8033FC3A9CBBD4E65A9BE664DDCBEEEF0D3BE07017C3E9E48023E6C54D6BEC88EC1BD51B995BEA9296DBE74D8263FEA44093D76B7C03E8DF7DCBDED53BA3E13F0E73DD6ABACBE31351DBEA5AC383EABA05D3C964F54BE948D87BE0597E9BE0E8DDDBEDCE7023FA8E3BABDFACE37BFCD7CE9BD0B39C5BE18198E3E4295193FC22140BF9D91073C934FC6BD1FAE143E34A8033E6D6F97BEA4C11EBFF4F6823E7EC5BCBE7D33D4BD78AFF73E961E86BD0F08D7BD53CD1A3F"> : tensor<25x20xf32>
    %1 = onnx.Constant dense<"0x0B2E463D8E9F6CBF158C653EF867733E2B62D4BDF1750C3D77C330BF41161ABF0F1F6ABFEB92813D2F1F5EBEC2EC70BE118E8ABED835DF3E01A633BE32CD133E320ED63ECD0C863FA916A33E947B213E662CCF3E4D1FD93E5659233E0BCA3B3E339C77BEDAB9B8BD1DE35DBE69B0BF3E64690ABF901ED33EF0757D3DAFAFE7BE621A503EADE526BC05714B3FDD91A6BEDCB30DBFC0E92C3F55CA82BD90C6983EF33385BED15F693E6F48A5BEDC0AECBE3C020C3F9796A33E58C602BE7740883E1589813D555A3B3E934BE03E3C0A433F4C0C9F3E8C1BDD3EAE07B13E352D30BF4B02EF3DF0BCEA3E064288BE3F1AAB3E821F9B3E5D484EBEDC30853DDA0A373FE4579D3EBF8BCBBE18C1A7BE098DE8BE1FCCB13E5EC8D5BE6742EB3E3734D3BEF1A7333EB60D593DD3FF40BEAC32793E1752E13E4D606EBFDD0704BFBC2B5EBE3A733DBE5D491A3F64ED45BED85CDA3D9DA19CBD768CC63E263D4C3FAD9673BDC49447BCBEAECD3E0D9B9B3E057909BD38EDC6BE511727BF6B47463FE98DADBEAA37843D849102BD65C92A3F3BC4C1BE271B1B3F4CEBF4BEB37E113F0E6DB03EF3634DBD2A7B0E3FC96DB43E5E4F1CBD8FD9C5BDE9E97FBD5AB9293F190C0A3E161BF13E4CF34C3E5FCD5BBEB4BABDBE8005F5BCAE237A3F1EA220BC0842E4BE669E823C89D21E3F7461683E7507D43D4D51CCBEE6F79CBD9CF320BF28CAFC3DD5F1F2BE001F023F8DCA263E581A77BE4994D13D5A54813F4FE4DFBE09121ABF3D0188BE779803BF66E8DBBE505829BDF0C81BBFE047CBBEF5D5CC3E96E18C3EA8D19DBE3D85DC3E2EE8E8BEF1DEF03EFE01ACBE62D5DB3EB0F2C8BEB430C53E5CFFA93ED455853DE02955BD458A6F3E5F8318BD354B723ED0C449BE4A00E9BBF67B21BF34EC223D068833BF58D5473C181E3A3FA5D6C53EB49E5A3D7DA0203FF01FD2BD513D1F3DCEF3AABEF322F7BEC1F13EBE08ECA3BDECD3E7BE4CCA2ABEEABC843EC812973E548F933E970D28BEAC2173BCEF0072BEE3B3263A146E113F887C36BE863099BF33EBF43DFB84833E290E3A3E6347AA3EB4AB513F33A1843FD942DBBD4C9A09BFAC6307BF8D298BBDE8AE57BF227C983D30451C3E202743BF14FE5C3E211E003ED13A2ABFB8355CBD634C203F4829623EE3BDA83E821F3EBED661EC3E0FCD75BE4CA1893D6027493D3213573EB1BBBC3EEA50DBBDF2F2EE3EF557B13C8523E33EE3ACA03EC545D7BEDA1CFD3E6F91A4BE74421FBFBB1129BDCB6ECE3E2B888B3E4CD72C3E5518623E147ECBBDF28F2E3E090C97BE081DB0BEB07163BE4B641EBFD7C0D0BD9057A9BE5BD824BF871DD9BD1A63593F05C1EF3EF03F54BEA7391DBD80DA16BFD04E313F5D15B0BD4C12A33E607809BE6CC4D2BED3D49DBED6030ABF9E6F8CBE1FCA1BBEA281F23EB6A94B3B11D072BEE01F8DBE1D79E23CD4871BBF2A7AB53CA9C5B23ED7E6833B21B43A3F1A0D123F4335C1BEE42B1C3FF8BB4D3E0C5F143EB755F9BD4CB524BC5439B93CE82A3DBFE496A0BC3FA7093F8CAF803D5E0D8D3E90E333BD29C93EBF3E98043F2CCD7C3C144B14BEF89AC13F7542083EAA5084BE9DC1CDBEA4F8D93CAF18A0BE5D25513F52A6A03C93D111BEF6EEA93E9DA30EBF26CD123F2618273F84D9CFBE822C7C3E3405313EDE72663ECF7CAD3CB24EB23DFD3400BE"> : tensor<20x15xf32>
    %2 = onnx.Constant dense<"0xE62782BE80B139BF0E5E81BF36B8C33E96CBA63E70A11ABE8E7232BF65AC16BC99EB18BE3225243E732206BF0F1F543FFD1F9F3E733CA23E03DFA43E14F84EBFAB36553E9D73013F2F4F62BEC1025BBE70A86ABE4DDE423F76790FBFFCF9F3BDA656233E2F9DE4BEE5E8A6BE1BFA053FC60187BE4415CA3EC33BAFBE8FBA75BFB91AE33E86C441BF46D9F33E3A7428BF8EB8B9BDC6D5953D155733BE5089B03EA7D9923E80CA86BEB602CB3E242F243E6BEBA8BE1254423F426A8EBF9F56F13E01258C3C4427A6BE7852A8BE0334843EF8B0C33E2B813BBED7BCDC3E70ACD23D2414E23EA022ACBE0AAB00BFE5B686BF7138F53C27059BBDD7C749BE8FC81DBFF661AFBE61A99CBEDCA6063F782D4BBF5CFF1A3FE36921BEF0DDBFBA5E64083F25CB1E3F1426D63EC51320BF0432493DDF63E5BED336443F848DBEBD3685E63E77F7723E70F02CBFC0B5143C4B4A4F3EC8AAA3BEE504953E06758B3FFDB51C3F82D00ABF217DDBBE39087A3B0449153E6530173F6EDBAFBBE647163F74F0D1BEE691E33D410A3E3FE4DCD93D75AA84BFE969E9BD97AA3C3F90BE3F3E22B2E03CA96C093DE243C83E438EB73D3FC2A9BE1CDCB4BEAEEC26BF8702BDBE4E833EBFE5293B3DFB1A263E99C2173F6C47523EC1C6C53C0F120B3E333548BFC0BB863D9D093CBF60805FBEC1E227BFDAB5693DA46A463E73C74A3F3D69CEBE46DE5ABF7EFCC23CEB0B1F3E1666C9BEE64A363E29F0E03E1EA6113F336D93BF6D3E7ABE4A7948BF6960823D645F253E8B0C843C6502793F57AA0FBEB8F12D3E78FD6ABEB10D523DDEBE9D3E52A5353E7CB7F43D9273283D89A89A3E"> : tensor<15x10xf32>
    %3 = "onnx.Flatten"(%arg0) {axis = 1 : si64, onnx_node_name = "/flatten/Flatten"} : (tensor<?x25xf32>) -> tensor<?x25xf32>
    %4 = "onnx.MatMul"(%3, %0) {onnx_node_name = "/fc1/MatMul"} : (tensor<?x25xf32>, tensor<25x20xf32>) -> tensor<?x20xf32>
    %5 = "onnx.Relu"(%4) {onnx_node_name = "/relu/Relu"} : (tensor<?x20xf32>) -> tensor<?x20xf32>
    %6 = "onnx.MatMul"(%5, %1) {onnx_node_name = "/fc2/MatMul"} : (tensor<?x20xf32>, tensor<20x15xf32>) -> tensor<?x15xf32>
    %7 = "onnx.Relu"(%6) {onnx_node_name = "/relu_1/Relu"} : (tensor<?x15xf32>) -> tensor<?x15xf32>
    %8 = "onnx.MatMul"(%7, %2) {onnx_node_name = "/fc3/MatMul"} : (tensor<?x15xf32>, tensor<15x10xf32>) -> tensor<?x10xf32>
    return %8 : tensor<?x10xf32>
  }
  "onnx.EntryPoint"() {func = @main_graph} : () -> ()
}
